from math import inf, sqrt


def bitonicTSP(C):
    pass





C = [["Wrocław", 0, 1], ["Warszawa", 11, 5], ["Gdańsk", 4, 2],["Kraków", 2, 1], ["Szczecin", 7, 3], ["Rzeszów", 0.5, 4]]
print(bitonicTSP(C))

C = [["Wrocław", 0, 2], ["Warszawa", 4, 3], ["Gdańsk", 2, 4], ["Kraków", 3, 1]]
print(bitonicTSP(C))

C = [['A', 0, 2],['B', 1, 1],['C', 3, 2],['D', 6, 0],['E', 9, 0],['F', 8, 5],['G', 5, 5],['H', 2, 4],['I', 7, 0]]
print(bitonicTSP(C))

C = [['A', 0, 6],['B', 1, 0],['C', 6, 1],['D', 8, 2],['E', 7, 5],['F', 5, 4],['G', 2, 3]]
print(bitonicTSP(C))

C = [["Paprykarz-Szczeciński", 1, 3], ["Wrocław", 0, 2], ["Warszawa", 4, 3], ["Gdańsk", 2, 4], ["Kraków", 3, 1]]
print(bitonicTSP(C))

C = [['A', 0, 2], ['B', 1, 1], ['C', 4, 1], ['D', 5, 3], ['E', 6, 3], ['F', 8, 3], ['G', 7, 4], ['H', 2, 4],['I', 0.5, 2.5], ['J', 1.5, 3.5]]
print(bitonicTSP(C))

C = [["A", 0, 2], ["B", 4, 3], ["C", 2, 4], ["D", 3, 1], ["E", 1, 3], ["F", 0.5, -2]]
print(bitonicTSP(C))

C = [["1", 0, 1], ["2", 1, -6], ["3", 3, -1], ["4", 6, -2], ["5", 10, 1], ["6", 14, 3], ["7", 9, 4], ["8", 7, 2], ["9", 4, 3], ["10", 2, 3]]
print(bitonicTSP(C))

"""
Odpowiedzi:

25.459374412681353
10.46284073991415
24.34555711384423
25.58402459469133
10.46284073991415
18.705481427033437
15.236816791848371
41.00879765742148

"""